import { Question } from "@/types/quiz";

export const antiDopingQuestions: Question[] = [

{
id: "anti_doping-1",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Ποιος οργανισμός ελέγχει όλα τα συμπληρώματα διατροφής για απαγορευμένες ουσίες και τους παρέχει έγκριση κυκλοφορίας;",
answers: [
"ΕΟΦ",
"FDA",
"EMA",
"Κανένας"
],
correctAnswer: 3
},

{
id: "anti_doping-2",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Ποιο συμπλήρωμα διατροφής έχει το μικρότερο ρίσκο επιμόλυνσης;",
answers: [
"Αυτό που φέρει έγκριση του ΕΟΦ",
"Αυτό που φέρει έγκριση του FDA",
"Αυτό που είναι πρόσφατα ελεγμένο από το informed choice",
"Αυτό που φέρει έγκριση του WADA"
],
correctAnswer: 2
},

{
id: "anti_doping-3",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Ποιο από τα παρακάτω είναι σωστό;",
answers: [
"Ένα συμπλήρωμα που ισχυρίζεται ότι αντιμετωπίζει προβλήματα υγείας είναι ασφαλές",
"Ένα συμπλήρωμα που ελέγχεται από την informed sport μειώνει το ρίσκο παρουσίας απαγορευμένης ουσίας",
"Ένα συμπλήρωμα που δηλώνει 100% doping free είναι πάντα ασφαλές",
"Ένα συμπλήρωμα που συστήνεται από γυμναστή είναι ασφαλές"
],
correctAnswer: 1
},

{
id: "anti_doping-4",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Ποιοι είναι τρόποι συλλογής ανώνυμων ή επώνυμων πληροφοριών;",
answers: [
"Με ηλεκτρονικό ταχυδρομείο",
"Μέσω της πλατφόρμας «Μιλήστε Χωρίς Φόβο»",
"Προφορικά στο τηλέφωνο καταγγελιών του ΕΟΚΑΝ",
"Και οι τρεις προαναφερόμενοι τρόποι"
],
correctAnswer: 3
},

{
id: "anti_doping-5",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αν διαπιστωθεί χρήση απαγορευμένης ουσίας και ο αθλητής ισχυριστεί ότι έγινε εν αγνοία του:",
answers: [
"Του γίνεται απλή επίπληξη",
"Αν είναι ουσία μη ειδικής αναφοράς μπορεί να μη λάβει ποινή",
"Λόγω αντικειμενικής ευθύνης είναι υπεύθυνος για ό,τι βρεθεί στο δείγμα του",
"Αν αποδείξει ότι δεν ευθυνόταν δεν θα επιβληθεί ποινή"
],
correctAnswer: 2
},

{
id: "anti_doping-6",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αν μια ουσία προστεθεί στον Κατάλογο Απαγορευμένων του 2025:",
answers: [
"Ο αθλητής μπορεί να τη χρησιμοποιήσει έως 30/09/2024",
"Μπορεί να τη χρησιμοποιήσει έως 31/12/2024",
"Ο αθλητής ψ αφού ενημερωθεί στη 01/10/2024 για την νέα ουσία στον κατάλογο απαγορευμένων του 2025, θα πρέπει να προσέξει την περίοδο έκπλυσης της ουσίας. Υπάρχει πιθανότητα να λάβει την ουσία πριν τεθεί σε ισχύ ο νέος κατάλογος (01/01/2025) και παρόλα αυτά να βρεθεί στο δείγμα του με το νέο έτος.",
"Μπορεί να τη χρησιμοποιήσει έως ένα μήνα πριν ισχύσει ο νέος κατάλογος"
],
correctAnswer: 2
},

{
id: "anti_doping-7",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Η τεστοστερόνη και οι αναβολικοί παράγοντες μπορεί να προκαλέσουν:",
answers: [
"Σμίκρυνση μαστού στις γυναίκες και γυναικομαστία στους άνδρες",
"Τάσεις αυτοχειρίας κατά την απεξάρτηση",
"Ηπατική ανεπάρκεια",
"Όλα τα παραπάνω"
],
correctAnswer: 3
},

{
id: "anti_doping-8",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Ποιος αποτελεί βάσιμο λόγο καθυστέρησης άφιξης στο σταθμό ελέγχου ντόπινγκ;",
answers: [
"Επικοινωνία με οικογένεια",
"Κάλυψη θερμιδικών αναγκών",
"Τελετή βράβευσης",
"Ομαδική φωτογράφιση"
],
correctAnswer: 2
},

{
id: "anti_doping-9",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Πόσα ml τουλάχιστον πρέπει να είναι το δείγμα ούρων;",
answers: [
"90 ml",
"10 ml",
"50 ml",
"300 ml"
],
correctAnswer: 0
},

{
id: "anti_doping-10",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Πότε μια ουσία προστίθεται στον κατάλογο απαγορευμένων;",
answers: [
"Όταν ενισχύει την απόδοση",
"Όταν αποτελεί κίνδυνο για την υγεία",
"Όταν παραβιάζει το πνεύμα του αθλητισμού",
"Όταν ισχύουν τουλάχιστον δύο από τα παραπάνω"
],
correctAnswer: 3
},

{
id: "anti_doping-11",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Τι είναι η Κατ’ Εξαίρεση Χρήση για Θεραπευτικούς Σκοπούς (TUE);",
answers: [
"Άδεια χρήσης φαρμάκου από τον κατάλογο απαγορευμένων για θεραπεία",
"Άδεια χρήσης ουσίας για δύο εβδομάδες",
"Άδεια χρήσης λόγω νίκης",
"Άδεια συμμετοχής στον τελικό"
],
correctAnswer: 0
},

{
id: "anti_doping-12",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αθλητής σε έκτακτη ανάγκη έλαβε απαγορευμένη ουσία για θεραπεία:",
answers: [
"Να κάνει αίτηση για Εξαίρεση Χρήσης λόγω Θεραπευτικού Σκοπού όσο το δυνατόν συντομότερα",
"Να περιμένει έλεγχο",
"Να μην κάνει αίτηση",
"Να επικοινωνήσει με ΕΟΚΑΝ"
],
correctAnswer: 0
},

{
id: "anti_doping-13",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Aν βρεθεί στο δείγμα ενός αθλητή μια απαγορευμένη ουσία που ανήκει στην κατηγορία των «ουσιών κατάχρησης» (πχ κοκαΐνη), ο αθλητής μπορεί να λάβει μειωμένη ποινή τριών μηνών αν αποδείξει",
answers: [
"Αν είχε σοβαρό λόγο",
"Αν δεν γνώριζε την απαγόρευση",
"Αν πήρε μικρή ποσότητα",
"Ότι η χρήση πραγματοποιήθηκε εκτός αγώνα και δεν σχετίζεται με την αθλητική απόδοση"
],
correctAnswer: 3
},

{
id: "anti_doping-14",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αθλητής με ποινή 2 ετών από ΕΟΚΑΝ μπορεί:",
answers: [
"Να ασκήσει προσφυγή στο Aνώτατο Συμβούλιο Επίλυσης Aθλητικών Διαφορών (AΣΕAΔ) εντός της προβλεπόμενης προθεσμίας ",
"Να προσφύγει στο ειρηνοδικείο",
"Να αγωνίζεται στο εξωτερικό",
"Να αγνοήσει την απόφαση"
],
correctAnswer: 0
},

{
id: "anti_doping-15",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αν ο παραβάτης είναι προστατευόμενο πρόσωπο:",
answers: [
"Τιμωρούνται οι γονείς",
"Δεν επιβάλλεται ποινή",
"Δια βίου αποκλεισμός",
"Aν μπορεί να αποδειχθεί ότι δεν υπάρχει σοβαρή υπαιτιότητα, τότε η επιβαλλόμενη συνέπεια κυμαίνεται από επίπληξη χωρίς περίοδο αποκλεισμού, κατ’ ελάχιστο, μέχρι δύο (2) έτη αποκλεισμού, κατά μέγιστο"
],
correctAnswer: 3
},

{
id: "anti_doping-16",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αν προπονητής χορηγήσει απαγορευμένη ουσία σε ανήλικο:",
answers: [
"Απαλλάσσεται αν συμφωνούν οι γονείς",
"Φυλάκιση έως 5 έτη",
"Επιβάλλεται κάθειρξη τουλάχιστον δέκα (10) ετών και ισόβια στέρηση της άδειας άσκησης σχετικού με τον αθλητισμό επαγγέλματος",
"Ισόβια κάθειρξη"
],
correctAnswer: 2
},

{
id: "anti_doping-17",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Αν αθλητής επιλεγεί για έλεγχο ντόπινγκ:",
answers: [
"Μπορεί να αρνηθεί",
"Υποχρεούται να υποβληθεί στον έλεγχο",
"Μπορεί να κλείσει ραντεβού",
"Μπορεί να στείλει επιστολή"
],
correctAnswer: 1
},

{
id: "anti_doping-18",
lessonId: "anti_doping",
lessonTitle: "Αντιντόπινγκ",
text: "Σε παράβαση κανόνα αντιντόπινγκ εκτός από αποκλεισμό μπορεί να επιβληθεί:",
answers: [
"Απαγόρευση στο άθλημα",
"Κοινωφελής εργασία",
"Δεύτερη ευκαιρία",
"Οικονομικό πρόστιμο"
],
correctAnswer: 3
}

];
