import { Question } from "@/types/quiz";

export const childProtectionQuestions: Question[] = [

{
id: "child_protection-1",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Ο βασικός νόμος για τα δικαιώματα του παιδιού είναι:",
answers: [
"Το Σύνταγμα της Ελλάδας",
"Η Οικουμενική Διακήρυξη Δικαιωμάτων του Ανθρώπου",
"Η Διεθνής Σύμβαση για τα Δικαιώματα του Παιδιού",
"Ο Αστικός Κώδικας"
],
correctAnswer: 2
},

{
id: "child_protection-2",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Ποιο από τα παρακάτω αποτελεί γενική αρχή της Σύμβασης για τα Δικαιώματα του Παιδιού;",
answers: [
"Το δικαίωμα στην εκπαίδευση",
"Ο σεβασμός στις απόψεις του παιδιού",
"Η προστασία από την κακοποίηση",
"Η προστασία του παιδιού θύματος"
],
correctAnswer: 1
},

{
id: "child_protection-3",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Ποιο χαρακτηριστικό απαιτείται για να θεωρηθεί bullying;",
answers: [
"Έντονη βία",
"Συστηματική / επαναλαμβανόμενη συμπεριφορά",
"Σωματική βία",
"Μεταξύ διαφορετικών φύλων"
],
correctAnswer: 1
},

{
id: "child_protection-4",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Τα δικαιώματα του παιδιού αφορούν άτομα:",
answers: [
">8 ετών",
"Έως 15 ετών",
"Από τη γέννηση έως τα 18 έτη",
"<21 ετών"
],
correctAnswer: 2
},

{
id: "child_protection-5",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Αθλήτρια εμφανίζεται με κακώσεις και αποκαλύπτει ότι δέχεται βία στο σπίτι. Έχει υποχρέωση ενέργειας η προπονήτρια;",
answers: [
"Όχι, γιατί δεν το είπε το ίδιο το παιδί",
" Ναι, γιατί δεσμεύεται από τον νόμο για την ενδοοικογενειακή βία (Ν. 3500/2006),που επιβάλλει ενημέρωση των αρμόδιων αρχών.",
"Όχι, δεν πρέπει να ανακατεύεται",
"Όχι, μόνο συζήτηση με τους γονείς"
],
correctAnswer: 1
},

{
id: "child_protection-6",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Ο ιδιώτης προπονητής δεσμεύεται από την υποχρέωση αναφοράς πιθανής κακοποίησης;",
answers: [
"Ναι, δεν γίνεται διάκριση μεταξύ δημόσιων υπαλλήλων και ιδιωτών.",
"Όχι, αφορά μόνο σχολεία",
"Όχι, αφορά μόνο δημόσιους γυμναστές",
"Ναι, αλλά μόνο για παιδιά κάτω των 10"
],
correctAnswer: 0
},

{
id: "child_protection-7",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Ποια υπηρεσία ΔΕΝ είναι αρμόδια να δεχτεί αναφορά;",
answers: [
"Εισαγγελία",
"Αστυνομία",
"Ομάδα Προστασίας Ανηλίκων Δήμου",
"Υπουργείο Παιδείας"
],
correctAnswer: 3
},

{
id: "child_protection-8",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Προπονητής έχει σεξουαλική σχέση με 16χρονο αθλητή του. Είναι τιμωρητέο;",
answers: [
"Όχι γιατί είναι αρκετά μεγάλος",
"Ναι, ανεξάρτητα από την ηλικία του παιδιού, καθώς πρόκειται για κατάχρηση ανηλίκου.",
"Δεν είναι ηθικό αλλά δεν τιμωρείται",
"Εξαρτάται ποιος προσέγγισε τον άλλο"
],
correctAnswer: 1
},

{
id: "child_protection-9",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Προπονητής αποκαλεί αθλητή «άχρηστο» και τον ταρακουνά. Η συμπεριφορά είναι:",
answers: [
"Αναγκαία για κινητοποίηση",
"Οριακά αποδεκτή",
"Παράνομη γιατί αποτελεί άσκηση βίας",
"Αποδεκτή αν συμφωνούν οι γονείς"
],
correctAnswer: 2
},

{
id: "child_protection-10",
lessonId: "child_protection",
lessonTitle: "Παιδική Προστασία",
text: "Τι θεωρείται σημαντικό για πρόληψη περιστατικών βίας στον αθλητισμό;",
answers: [
"Δημιουργία κλίματος εμπιστοσύνης και επικοινωνίας",
"Ενημέρωση ότι μπορούν να πάνε στην αστυνομία",
"Απειλή αποβολής από την ομάδα",
"Άμεση ενημέρωση κηδεμόνων για κάθε περιστατικό"
],
correctAnswer: 0
}

];
