import { Question } from "@/types/quiz";

export const ethicsIntegrityQuestions: Question[] = [

{
id: "ethics_integrity-1",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιο είναι το τρίπτυχο που εμπεριέχει η έννοια της αθλητικής ακεραιότητας σύμφωνα με το Συμβούλιο της Ευρώπης;",
answers: [
"Η ακεραιότητα αθλητών, προπονητών, διαιτητών",
"Η ακεραιότητα φυσικών προσώπων, διοργανώσεων και οργανισμών",
"Η ακεραιότητα αθλητών, διεθνών ομοσπονδιών και διαιτητών",
"Η ακεραιότητα αθλητών, γονέων και προπονητών"
],
correctAnswer: 1
},

{
id: "ethics_integrity-2",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιο από τα παρακάτω είναι μορφή χειραγώγησης;",
answers: [
"Συνεχείς αλλαγές αθλητών από τον προπονητή",
"Απόσυρση από τουρνουά λόγω τραυματισμού",
"Σκόπιμα μειωμένη απόδοση αθλητών για επηρεασμό αντιπάλου",
"Νίκη με μεγάλη διαφορά"
],
correctAnswer: 2
},

{
id: "ethics_integrity-3",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιο από τα παρακάτω είναι μορφή χειραγώγησης;",
answers: [
"Χειραγώγηση στοιχείων αγώνα όπως πρώτη κάρτα ή κόρνερ",
"Λάθος στην πρώτη φάση",
"Απόδοση χαμηλότερη από το αναμενόμενο",
"Δήλωση στον τύπο ότι κάποιος είναι φαβορί"
],
correctAnswer: 0
},

{
id: "ethics_integrity-4",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Τι σημαίνει spot fixing;",
answers: [
"Καθορισμός συγκεκριμένων στοιχείων ενός αγώνα εκτός του τελικού αποτελέσματος",
"Καθορισμός τελικού αποτελέσματος",
"Διάδοση εσωτερικών πληροφοριών",
"Αδυναμία αναφοράς"
],
correctAnswer: 0
},

{
id: "ethics_integrity-5",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποια φράση περιγράφει μορφή χειραγώγησης;",
answers: [
"Αλλαγές για να παίξουν όλοι",
"Το αποτέλεσμα δεν αλλοιώνεται",
"Κακή διάθεση αθλητών",
"Χειραγώγηση μεμονωμένων στοιχείων αγώνα"
],
correctAnswer: 3
},

{
id: "ethics_integrity-6",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποια φράση περιγράφει μορφή χειραγώγησης;",
answers: [
"Bookmakers χωρίς εσωτερικές πληροφορίες",
"Σκόπιμη μειωμένη απόδοση αθλητών",
"Αγώνες οργανωμένοι κανονικά",
"Καθυστερημένη δημοσίευση αποτελεσμάτων"
],
correctAnswer: 1
},

{
id: "ethics_integrity-7",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποια από τις παρακάτω περιγράφει μορφή χειραγώγησης;",
answers: [
"Bookmakers χωρίς εσωτερικές πληροφορίες",
"Σκόπιμη μειωμένη απόδοση για επηρεασμό στοιχηματισμού",
"Αγώνες οργανωμένοι κανονικά",
"Καθυστερημένα αποτελέσματα"
],
correctAnswer: 1
},

{
id: "ethics_integrity-8",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Όταν κάποιος αντιμετωπίζει ηθικό δίλημμα επιλέγει σύμφωνα με:",
answers: [
"Τον προπονητή",
"Την ομοσπονδία",
"Τη συνήθη πρακτική συναθλητών",
"Τον προσωπικό αξιακό κώδικα"
],
correctAnswer: 3
},

{
id: "ethics_integrity-9",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Γιατί το οργανωμένο έγκλημα ενδιαφέρεται για τον αθλητισμό;",
answers: [
"Επειδή ενδιαφέρει τους πάντες",
"Επειδή το ρίσκο είναι μικρό σε σχέση με το κέρδος",
"Επειδή υπάρχει νομοθετική κάλυψη",
"Για δημοσιότητα"
],
correctAnswer: 1
},

{
id: "ethics_integrity-10",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Πώς ονομάζονταν τα αγάλματα πριν την είσοδο στο στάδιο της Ολυμπίας;",
answers: [
"Ζάνες",
"Ζευς",
"Δίες",
"Κανένα από τα παραπάνω"
],
correctAnswer: 0
},

{
id: "ethics_integrity-11",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποια σύμβαση είναι το μόνο διεθνές δεσμευτικό νομικό κείμενο για χειραγώγηση αγώνων;",
answers: [
"Συνθήκη Λοζάνης",
"Λευκή Βίβλος ΕΕ",
"Σύμβαση κατά του ντόπινγκ",
"Σύμβαση Macolin"
],
correctAnswer: 3
},

{
id: "ethics_integrity-12",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιος μπορεί να χειραγωγήσει άμεσα έναν αγώνα;",
answers: [
"Αθλητές",
"Διοικήσεις σωματείων",
"Φίλοι",
"Μάνατζερ"
],
correctAnswer: 0
},

{
id: "ethics_integrity-13",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιος μπορεί να χειραγωγήσει άμεσα έναν αγώνα;",
answers: [
"Φίλοι και συγγενείς",
"Διοικήσεις σωματείων",
"Προπονητές",
"Μάνατζερ"
],
correctAnswer: 2
},

{
id: "ethics_integrity-14",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιος μπορεί να χειραγωγήσει έμμεσα έναν αγώνα;",
answers: [
"Προπονητές",
"Φίλοι και συγγενείς",
"Αθλητές",
"Διαιτητές"
],
correctAnswer: 1
},

{
id: "ethics_integrity-15",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιος μπορεί να χειραγωγήσει έμμεσα έναν αγώνα;",
answers: [
"Προπονητές",
"Αθλητές",
"Διαιτητές",
"Παλαίμαχοι αθλητές"
],
correctAnswer: 3
},

{
id: "ethics_integrity-16",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Ποιοι είναι παράγοντες τρωτότητας ενός ατόμου;",
answers: [
"Ηλικία, άθλημα, οικονομική κατάσταση",
"Ηλικία, οικονομική κατάσταση, εθισμός στον τζόγο",
"Εισόδημα, επαγγελματική κατάσταση, εθισμός στον τζόγο",
"Άθλημα, εθισμός στον τζόγο, οικονομική κατάσταση"
],
correctAnswer: 1
},

{
id: "ethics_integrity-17",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Τι περιλαμβάνεται στον Κώδικα Δεοντολογίας της ΔΟΕ;",
answers: [
"Δεν στοιχηματίζω στο άθλημά μου",
"Μπορώ να στοιχηματίζω εκτός της ομάδας μου",
"Δεν συμμετέχω μόνο σε επίσημους αγώνες",
"Μπορώ να μοιράζομαι εσωτερικές πληροφορίες"
],
correctAnswer: 0
},

{
id: "ethics_integrity-18",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Τι περιλαμβάνεται στον Κώδικα Δεοντολογίας της ΔΟΕ;",
answers: [
"Στοιχηματίζω στο άθλημά μου",
"Αποφεύγω τη διάχυση εσωτερικών πληροφοριών",
"Δεν συμμετέχω μόνο σε επίσημους αγώνες",
"Μοιράζομαι πληροφορίες"
],
correctAnswer: 1
},

{
id: "ethics_integrity-19",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Τι περιλαμβάνεται στον Κώδικα Δεοντολογίας της ΔΟΕ;",
answers: [
"Στοιχηματίζω",
"Αναφέρω ύποπτη προσέγγιση",
"Μοιράζομαι πληροφορίες",
"Στήνω μόνο επίσημους αγώνες"
],
correctAnswer: 1
},

{
id: "ethics_integrity-20",
lessonId: "ethics_integrity",
lessonTitle: "Ηθική και Ακεραιότητα",
text: "Τι μπορώ να ποστάρω στα social media;",
answers: [
"Τραυματισμό συμπαίκτη",
"Τακτική της ομάδας",
"Αισιόδοξη δήλωση για τον αγώνα",
"Εσωτερικό καβγά ομάδας"
],
correctAnswer: 2
}

];
