import { Question } from "@/types/quiz";

export const physiotherapyQuestions: Question[] = [

{
id: "physiotherapy-1",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η ιδιοδεκτικότητα είναι:",
answers: [
"Η δυνατότητα ανάπτυξης δύναμης",
"Η πρόωρη εμφάνιση καμάτου",
"Μία πολύπλοκη νευρομυϊκή διαδικασία με απαγωγικές και προσαγωγικές ώσεις",
"Τίποτα από τα παραπάνω"
],
correctAnswer: 2
},

{
id: "physiotherapy-2",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η ιδιοδεκτικότητα επηρεάζεται μετά από τραυματισμό:",
answers: [
"Μόνο στην παιδική ηλικία",
"Μόνο στους συνδεσμικούς τραυματισμούς",
"Σε όλους τους τραυματισμούς",
"Μόνο στα κατάγματα"
],
correctAnswer: 2
},

{
id: "physiotherapy-3",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Ο κινητικός έλεγχος και η ιδιοδεκτικότητα:",
answers: [
"Είναι εντελώς διαφορετικές έννοιες",
"Σημαίνουν το ίδιο όταν αναφέρονται σε τραυματισμούς",
"Τίποτα από τα παραπάνω",
"Είναι ταυτόσημες έννοιες"
],
correctAnswer: 2 //was 0 changed to 2
},

{
id: "physiotherapy-4",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Ο νευρομυϊκός συντονισμός προϋποθέτει:",
answers: [
"Αυτοματοποίηση κινητικού προτύπου, ρυθμική ικανότητα, οικονομία ενέργειας, μείωση τραυματισμών",
"Οικονομία ενέργειας",
"Ρυθμική ικανότητα",
"Τίποτα από τα παραπάνω"
],
correctAnswer: 0
},

{
id: "physiotherapy-5",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η λανθασμένη στάση του σώματος:",
answers: [
"Ευνοεί μόνο τραυματισμούς σπονδυλικής στήλης",
"Είναι βασική αιτία διαστρεμμάτων ποδοκνημικής",
"Δεν είναι αιτία τραυματισμών",
"Καμία απάντηση δεν είναι σωστή"
],
correctAnswer: 3 //changed to 3 was 1
},

{
id: "physiotherapy-6",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η φυσιολογική στάση του σώματος:",
answers: [
"Μόνο στην εφηβική ηλικία",
"Μόνο μετά την μυοσκελετική ωρίμανση",
"Είναι ίδια για όλους αλλά μοναδική στην έκφρασή της",
"Δεν υπάρχει φυσιολογική στάση σώματος"
],
correctAnswer: 2
},

{
id: "physiotherapy-7",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Κατά την εφαρμογή προπονητικών προγραμμάτων:",
answers: [
"Εμφανίζονται θετικές και αρνητικές προσαρμογές",
"Εμφανίζονται μόνο θετικές προσαρμογές",
"Εμφανίζονται μόνο αρνητικές προσαρμογές",
"Καμία απάντηση δεν είναι σωστή"
],
correctAnswer: 0
},

{
id: "physiotherapy-8",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Κατά την χαλαρή στάση παρατηρούμε:",
answers: [
"Μεγάλη πρόσθια κλίση πυέλου, αυξημένη λόρδωση και κύφωση",
"Μεγάλη πρόσθια κλίση πυέλου",
"Θέση κεφαλής προς τα εμπρός",
"Αυξημένη οσφυϊκή λόρδωση"
],
correctAnswer: 0
},

{
id: "physiotherapy-9",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Ο αρθρικός χόνδρος:",
answers: [
"Δεν συναντάται στα άκρα των οστών",
"Συναντάται στα άκρα των οστών",
"Συναντάται σπάνια",
"Συναντάται κάποιες φορές"
],
correctAnswer: 1
},

{
id: "physiotherapy-10",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Ο αρθρικός χόνδρος:",
answers: [
"Δεν απορροφά φορτία",
"Κατανέμει τα φορτία",
"Απορροφά και κατανέμει τα φορτία",
"Σπάνια απορροφά φορτία"
],
correctAnswer: 2
},

{
id: "physiotherapy-11",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Οι χόνδρινες βλάβες:",
answers: [
"Έχουν τέλεια αποκατάσταση",
"Δεν έχουν τέλεια αποκατάσταση",
"Ποτέ δεν έχουν τέλεια αποκατάσταση",
"Συνήθως έχουν τέλεια αποκατάσταση"
],
correctAnswer: 2
},

{
id: "physiotherapy-12",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Τα παραμελημένα διαστρέμματα δημιουργούν πάντοτε χόνδρινες βλάβες",
answers: [
"Δεν δημιουργούν χόνδρινες βλάβες",
"Δημιουργούν σπάνια χόνδρινες βλάβες",
"Δημιουργούν πάντοτε χόνδρινες βλάβες",
"Δεν δημιουργούν ποτέ χόνδρινες βλάβες"
],
correctAnswer: 2
},

{
id: "physiotherapy-13",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η λανθασμένη στάση σώματος:",
answers: [
"Προκαλεί χόνδρινες βλάβες",
"Δεν προκαλεί χόνδρινες βλάβες",
"Ποτέ δεν προκαλεί χόνδρινες βλάβες",
"Προκαλεί πάντοτε χόνδρινες βλάβες"
],
correctAnswer: 3 //mporei na einai to 3
},

{
id: "physiotherapy-14",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Οι τενοντίτιδες:",
answers: [
"Δεν ανήκουν στα σύνδρομα υπέρχρησης",
"Ανήκουν στα σύνδρομα υπέρχρησης",
"Σπάνια ανήκουν",
"Δεν είναι σύνδρομα υπέρχρησης"
],
correctAnswer: 1
},

{
id: "physiotherapy-15",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Ο πόνος στην τενοντίτιδα:",
answers: [
"Δεν είναι χαρακτηριστικό",
"Σπάνια είναι χαρακτηριστικό",
"Είναι βασικό χαρακτηριστικό",
"Ποτέ δεν είναι χαρακτηριστικό"
],
correctAnswer: 2
},

{
id: "physiotherapy-16",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Οι μυϊκές διατάσεις στην αποκατάσταση τενοντίτιδας:",
answers: [
"Είναι απαραίτητες",
"Δεν είναι απαραίτητες",
"Σπάνια είναι απαραίτητες",
"Είναι πάντοτε απαραίτητες"
],
correctAnswer: 3
},

{
id: "physiotherapy-17",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Η τενοντίτιδα Αχίλλειου:",
answers: [
"Είναι σπάνια",
"Δεν είναι σπάνια",
"Είναι πολύ σπάνια",
"Είναι συνήθης"
],
correctAnswer: 3
},

{
id: "physiotherapy-18",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Οι ίνες των τενόντων σε ηρεμία:",
answers: [
"Δεν έχουν κυματοειδή διάταξη",
"Έχουν κυματοειδή διάταξη",
"Σπάνια έχουν κυματοειδή διάταξη",
"Έχουν πάντα κυματοειδή διάταξη"
],
correctAnswer: 3
},

{
id: "physiotherapy-19",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Στις τενοντίτιδες:",
answers: [
"Εφαρμόζουμε πάντα πάγο",
"Δεν εφαρμόζουμε ποτέ πάγο",
"Εφαρμόζουμε πάντα θερμό",
"Δεν εφαρμόζουμε θερμό"
],
correctAnswer: 0
},

{
id: "physiotherapy-20",
lessonId: "physiotherapy",
lessonTitle: "Φυσικοθεραπεία",
text: "Τι είναι κάταγμα;",
answers: [
"Διακοπή της φυσιολογικής συνέχειας του οστού",
"Βλάβη συνδέσμων",
"Τραυματισμός τενόντων",
"Καμία απάντηση δεν είναι σωστή"
],
correctAnswer: 0
}

];
