import { Question } from "@/types/quiz";

export const researchMethodologyQuestions: Question[] = [

{
id: "research_methodology-1",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ποια από τα ακόλουθα ΔΕΝ αποτελεί ιδιαίτερο χαρακτηριστικό της έρευνας;",
answers: [
"Η συστηματικότητα",
"Η εμπειρική αξιολόγηση",
"Η ορθο-λογική αξιολόγηση",
"Η πολυπλοκότητα"
],
correctAnswer: 3
},

{
id: "research_methodology-2",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ποιο από τα παρακάτω ΔΕΝ αποτελεί χαρακτηριστικό της επιστημονικής έρευνας;",
answers: [
"Αξιολόγηση βάσει στατιστικών αποτελεσμάτων",
"Τεκμηρίωση βάσει βιβλιογραφίας",
"Διαμόρφωση πρωτοκόλλου έρευνας",
"Εφαρμογή επαγωγικής μεθόδου"
],
correctAnswer: 3
},

{
id: "research_methodology-3",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Η ποιοτική έρευνα επικεντρώνεται:",
answers: [
"Στη γενίκευση αποτελεσμάτων",
"Στην κατανόηση εμπειριών και συμπεριφορών",
"Στην ανάλυση αριθμητικών δεδομένων",
"Στην εμπειρική θέση του ερευνητή"
],
correctAnswer: 1
},

{
id: "research_methodology-4",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Μια μέθοδος που χρησιμοποιείται στην ποιοτική έρευνα είναι:",
answers: [
"Αξιολόγηση με στατιστικά αποτελέσματα",
"Υποθετικό αποτέλεσμα έρευνας",
"Στοχευμένη συνέντευξη με συγκεκριμένα κριτήρια επιλογής",
"Εμπειρική μέθοδος"
],
correctAnswer: 2
},

{
id: "research_methodology-5",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Μία κύρια διαφορά μεταξύ ποιοτικής και ποσοτικής έρευνας είναι:",
answers: [
"Η ποσοτική χρησιμοποιεί συνεντεύξεις",
"Η ποιοτική χρησιμοποιεί μεγάλο δείγμα",
"Η ποσοτική ερμηνεύει κοινωνικά φαινόμενα",
"Η ποιοτική εστιάζει σε βάθος κατανόηση ενώ η ποσοτική σε στατιστική μέτρηση και γενίκευση"
],
correctAnswer: 3
},

{
id: "research_methodology-6",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ένα πλεονέκτημα της ποιοτικής έρευνας είναι:",
answers: [
"Υποκειμενική ερμηνεία δεδομένων",
"Μικρό δείγμα",
"Συλλογή λεπτομερών δεδομένων εμπειριών και στάσεων",
"Τυποποιημένες αριθμητικές μετρήσεις"
],
correctAnswer: 2
},

{
id: "research_methodology-7",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Η υπόθεση μιας έρευνας είναι:",
answers: [
"Αξιολόγηση στατιστικών αποτελεσμάτων",
"Διαμόρφωση πρωτοκόλλου",
"Υποθετικό αποτέλεσμα ή στόχος της ερευνητικής διαδικασίας",
"Εφαρμογή επαγωγικής μεθόδου"
],
correctAnswer: 2
},

{
id: "research_methodology-8",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ανεξάρτητη μεταβλητή είναι:",
answers: [
"Χαρακτηριστικά που μεταβάλλονται λόγω επίδρασης",
"Μεταβλητή που χειρίζεται ο ερευνητής για να δει την επίδρασή της",
"Εμπειρικές παρατηρήσεις",
"Μεταβλητές που δεν εξετάζονται"
],
correctAnswer: 1
},

{
id: "research_methodology-9",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ένα βήμα για επιλογή στατιστικής μεθόδου είναι:",
answers: [
"Εμπειρική αξιολόγηση κίνησης",
"Απόρριψη υπόθεσης",
"Οργάνωση και εξέταση μορφής των ερευνητικών δεδομένων",
"Επαγωγική μέθοδος"
],
correctAnswer: 2
},

{
id: "research_methodology-10",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Κατά τη δημιουργία πίνακα συχνοτήτων πρέπει να:",
answers: [
"Ορίσουμε ανεξάρτητη μεταβλητή",
"Ορίσουμε εσωτερική εγκυρότητα",
"Απομονώσουμε δεδομένα",
"Υπολογίσουμε εύρος τιμών (R)"
],
correctAnswer: 3
},

{
id: "research_methodology-11",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ποιο μέτρο κεντρικής τάσης αποδίδει καλύτερα την κεντρική τάση ενός δείγματος;",
answers: [
"Μέση τιμή",
"Επικρατούσα τιμή",
"Διάμεσος",
"Εύρος τιμών"
],
correctAnswer: 2
},

{
id: "research_methodology-12",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Η επικρατούσα τιμή:",
answers: [
"Μεταβάλλεται λόγω ανεξάρτητης μεταβλητής",
"Μπορεί να εμφανίζεται με δύο ή περισσότερες τιμές",
"Συσχετίζει μέσες τιμές δειγμάτων",
"Χρησιμοποιείται όταν υπάρχουν ακραίες τιμές"
],
correctAnswer: 1
},

{
id: "research_methodology-13",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Σε κανονική κατανομή η τυπική απόκλιση 1 SD περιλαμβάνει περίπου:",
answers: [
"50%  των τιμών",
"60%  των τιμών",
"68% των τιμών",
"90%  των τιμών"
],
correctAnswer: 2
},

{
id: "research_methodology-14",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Για να εντοπίσουμε περίπου το 70% των τιμών σε κανονική κατανομή υπολογίζουμε:",
answers: [
"Μέση τιμή και εύρος",
"Μέση τιμή και μία τυπική απόκλιση",
"Μέση τιμή και συντελεστή μεταβολής",
"Μέση τιμή και επικρατούσα τιμή"
],
correctAnswer: 1
},

{
id: "research_methodology-15",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Για να εξετάσουμε αν το ύψος επηρεάζει την επίδοση στο άλμα εις μήκος χρησιμοποιούμε:",
answers: [
"Εύρος τιμών",
"Τυπική απόκλιση",
"Συντελεστή μεταβολής",
"Συσχέτιση Pearson"
],
correctAnswer: 3
},

{
id: "research_methodology-16",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ποια πρόταση δείχνει θετική συσχέτιση;",
answers: [
"Εκγύμναση και φυσική κατάσταση έχουν αρνητική συσχέτιση",
"Μείωση βάρους και επίδοση στα μαθηματικά",
"Μυϊκή ενδυνάμωση κάτω άκρων και ταχύτητα λακτίσματος έχουν θετική συσχέτιση",
"Μυϊκή ενδυνάμωση και ευκαμψία άρθρωσης"
],
correctAnswer: 2
},

{
id: "research_methodology-17",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Ποιο από τα παρακάτω δεν αποτελεί μορφή t-test;",
answers: [
"Μονό δείγμα",
"Ανεξάρτητα δείγματα",
"Ζεύγος δειγμάτων",
"Τριών δειγμάτων"
],
correctAnswer: 3
},

{
id: "research_methodology-18",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Οι βαθμοί ελευθερίας:",
answers: [
"Είναι άλλη έκφραση εύρους τιμών",
"Μειώνονται όσο αυξάνονται οι περιορισμοί",
"Είναι άλλη έκφραση συντελεστή μεταβολής",
"Είναι άλλη έκφραση επικρατούσας τιμής"
],
correctAnswer: 1
},

{
id: "research_methodology-19",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Για να βρούμε ποιο άθλημα προτιμούν οι αθλητές χρησιμοποιούμε:",
answers: [
"t-test",
"Χ² (Chi-square) test",
"t-test ανεξάρτητων δειγμάτων",
"Συντελεστή συσχέτισης"
],
correctAnswer: 1
},

{
id: "research_methodology-20",
lessonId: "research_methodology",
lessonTitle: "Μεθοδολογία της Έρευνας",
text: "Το X² test χρησιμοποιείται όταν:",
answers: [
"Τα δεδομένα έχουν κανονική κατανομή",
"Ελέγχουμε αν οι διαφορές παρατηρούμενων και αναμενόμενων τιμών είναι σημαντικές",
"Οι βαθμοί ελευθερίας >10",
"Θέλουμε να δούμε την αξιοπιστία δείγματος"
],
correctAnswer: 1
}

];
